package jdk.util;

import com.alibaba.fastjson.JSON;
import com.alibaba.fastjson.TypeReference;

import java.util.Arrays;
import java.util.HashMap;
import java.util.List;
import java.util.Map;
import java.util.stream.Collectors;

public class ChannelTypeName {

    public static String channelTypeName = "\"1\",\"安卓支付宝\"\n" +
            "\"2\",\"安卓微信\"\n" +
            "\"3\",\"苹果IAP\"\n" +
            "\"4\",\"苹果补偿\"\n" +
            "\"5\",\"安卓补偿\"\n" +
            "\"6\",\"苹果微信公众号\"\n" +
            "\"7\",\"安卓微信公众号\"\n" +
            "\"8\",\"安卓喜点\"\n" +
            "\"9\",\"苹果喜点\"\n" +
            "\"10\",\"苹果奖励\"\n" +
            "\"11\",\"安卓奖励\"\n" +
            "\"12\",\"安卓喜点支付\"\n" +
            "\"13\",\"苹果喜点支付\"\n" +
            "\"14\",\"苹果支付宝H5\"\n" +
            "\"15\",\"安卓支付宝H5\"\n" +
            "\"16\",\"苹果兑换码\"\n" +
            "\"17\",\"安卓兑换码\"\n" +
            "\"18\",\"苹果微信扫码\"\n" +
            "\"19\",\"安卓微信扫码\"\n" +
            "\"20\",\"苹果直充\"\n" +
            "\"21\",\"安卓直充\"\n" +
            "\"22\",\"安卓充返喜点\"\n" +
            "\"23\",\"苹果充返喜点\"\n" +
            "\"24\",\"安卓开放平台支付宝\"\n" +
            "\"25\",\"苹果开放平台支付宝\"\n" +
            "\"26\",\"安卓开放平台微信\"\n" +
            "\"27\",\"苹果开放平台微信\"\n" +
            "\"28\",\"苹果开放平台IAP\"\n" +
            "\"29\",\"安卓开放平台百度钱包\"\n" +
            "\"30\",\"苹果开放平台百度钱包\"\n" +
            "\"31\",\"苹果优惠券\"\n" +
            "\"32\",\"安卓优惠券\"\n" +
            "\"33\",\"苹果VIP\"\n" +
            "\"34\",\"安卓VIP\"\n" +
            "\"35\",\"安卓喜钻\"\n" +
            "\"36\",\"苹果喜钻\"\n" +
            "\"37\",\"安卓喜蛋\"\n" +
            "\"38\",\"苹果喜蛋\"\n" +
            "\"39\",\"安卓广告\"\n" +
            "\"40\",\"苹果广告\"\n" +
            "\"41\",\"PC微信扫码\"\n" +
            "\"42\",\"PC支付宝扫码\"\n" +
            "\"43\",\"资金账户\"\n" +
            "\"44\",\"安卓开放平台华为银行\"\n" +
            "\"45\",\"苹果开放平台华为银行\"\n" +
            "\"46\",\"安卓开放平台华为零钱\"\n" +
            "\"47\",\"安卓开放平台华为零钱\"\n" +
            "\"48\",\"安卓开放平台华为花币\"\n" +
            "\"49\",\"苹果开放平台华为花币\"\n" +
            "\"50\",\"安卓开放平台华为支付宝\"\n" +
            "\"51\",\"苹果开放平台华为支付宝\"\n" +
            "\"52\",\"安卓开放平台华为微信\"\n" +
            "\"53\",\"安卓开放平台华为微信\"\n" +
            "\"54\",\"安卓开放平台华为神州付\"\n" +
            "\"55\",\"苹果开放平台华为神州付\"\n" +
            "\"56\",\"安卓开放平台华为游戏券\"\n" +
            "\"57\",\"苹果开放平台华为游戏券\"\n" +
            "\"58\",\"安卓开放平台华为手机话费\"\n" +
            "\"59\",\"苹果开放平台华为手机话费\"\n" +
            "\"60\",\"安卓代金券\"\n" +
            "\"61\",\"苹果代金券\"";

    public static void main(String[] args) {

        test();
    }

    public static void test1(){
        String[] channelTypeIdAndName = channelTypeName.split("\n");

        Arrays.asList(channelTypeIdAndName).stream().forEach(System.out::println);

        Map<String, String> channelTypeIdAndNameMap = new HashMap<>();

        List<String> list = Arrays.asList(channelTypeIdAndName);

        List<String> result = list.stream().map(data -> data.replace(",", ":")).collect(Collectors.toList());

        System.out.println(list);

        System.out.println(result);

        System.out.println(JSON.toJSONString(channelTypeIdAndNameMap));
    }

    public static String json="{\"1\":\"安卓支付宝\", \"2\":\"安卓微信\", \"3\":\"苹果IAP\", \"4\":\"苹果补偿\", \"5\":\"安卓补偿\", \"6\":\"苹果微信公众号\", \"7\":\"安卓微信公众号\", \"8\":\"安卓喜点\", \"9\":\"苹果喜点\", \"10\":\"苹果奖励\", \"11\":\"安卓奖励\", \"12\":\"安卓喜点支付\", \"13\":\"苹果喜点支付\", \"14\":\"苹果支付宝H5\", \"15\":\"安卓支付宝H5\", \"16\":\"苹果兑换码\", \"17\":\"安卓兑换码\", \"18\":\"苹果微信扫码\", \"19\":\"安卓微信扫码\", \"20\":\"苹果直充\", \"21\":\"安卓直充\", \"22\":\"安卓充返喜点\", \"23\":\"苹果充返喜点\", \"24\":\"安卓开放平台支付宝\", \"25\":\"苹果开放平台支付宝\", \"26\":\"安卓开放平台微信\", \"27\":\"苹果开放平台微信\", \"28\":\"苹果开放平台IAP\", \"29\":\"安卓开放平台百度钱包\", \"30\":\"苹果开放平台百度钱包\", \"31\":\"苹果优惠券\", \"32\":\"安卓优惠券\", \"33\":\"苹果VIP\", \"34\":\"安卓VIP\", \"35\":\"安卓喜钻\", \"36\":\"苹果喜钻\", \"37\":\"安卓喜蛋\", \"38\":\"苹果喜蛋\", \"39\":\"安卓广告\", \"40\":\"苹果广告\", \"41\":\"PC微信扫码\", \"42\":\"PC支付宝扫码\", \"43\":\"资金账户\", \"44\":\"安卓开放平台华为银行\", \"45\":\"苹果开放平台华为银行\", \"46\":\"安卓开放平台华为零钱\", \"47\":\"安卓开放平台华为零钱\", \"48\":\"安卓开放平台华为花币\", \"49\":\"苹果开放平台华为花币\", \"50\":\"安卓开放平台华为支付宝\", \"51\":\"苹果开放平台华为支付宝\", \"52\":\"安卓开放平台华为微信\", \"53\":\"安卓开放平台华为微信\", \"54\":\"安卓开放平台华为神州付\", \"55\":\"苹果开放平台华为神州付\", \"56\":\"安卓开放平台华为游戏券\", \"57\":\"苹果开放平台华为游戏券\", \"58\":\"安卓开放平台华为手机话费\", \"59\":\"苹果开放平台华为手机话费\", \"60\":\"安卓代金券\", \"61\":\"苹果代金券\"}";

    public static void test(){

        Map<Integer, String> jsonMap = JSON.parseObject(json, new TypeReference<Map<Integer, String>>() {});

        for(int i=1 ;i<10;i++){
            System.out.println(i+" = "+jsonMap.get(i));
        }

    }

}
